// src/app/components/classical.tsx
import React from 'react';

export const Classical1 = () => (
  <>
    <span style={{ color: 'brown' }}>[327a]</span>&nbsp; 
    <span style={{ color: 'black' }}>Σωκράτης:</span>&nbsp; 
    <span style={{ color: 'blue' }}>
      κατέβην χθὲς εἰς Πειραιᾶ μετὰ Γλαύκωνος τοῦ Ἀρίστωνος προσευξόμενος τε τῇ θεῷ καὶ ἅμα τὴν ἑορτὴν βουλόμενος θεάσασθαι τίνα τρόπον ποιήσουσιν ἅτε νῦν 
      πρῶτον ἄγοντες. καλὴ μὲν οὖν μοι καὶ ἡ τῶν ἐπιχωρίων πομπὴ ἔδοξεν εἶναι, οὐ μέντοι ἧττον ἐφαίνετο πρέπειν ἣν οἱ Θρᾷκες ἔπεμπον. &nbsp; 
      <span style={{ color: 'brown' }}>[327b]</span>&nbsp;
      προσευξάμενοι δὲ καὶ θεωρήσαντες ἀπῇμεν πρὸς τὸ ἄστυ. κατιδὼν οὖν πόρρωθεν ἡμᾶς οἴκαδε ὡρμημένους Πολέμαρχος ὁ Κεφάλου ἐκέλευσε δραμόντα τὸν παῖδα περιμεῖναί ἑκελεῦσαι.
    </span>
    <p style={{color:'red'}}>You can copy a word from the blue text and paste it in the search field then click on the search button to see the English translation. 
      Make sure not to copy any spaces...just copy the word.</p>
  </>
);

export const Classical2 = () => (
  <>
    <span style={{ color: 'blue' }}>
      <span style={{ color: 'brown' }}>[327b]</span>&nbsp; καί μου ὄπισθεν ὁ παῖς λαβόμενος τοῦ ἱματίου, κελεύει ὑμᾶς, ἔφη, Πολέμαρχος περιμεῖναι. καὶ ἐγὼ μετεστράφην τε καὶ ἠρόμην 
      ὅπου αὐτὸς εἴη. οὗτος, ἔφη, ὄπισθεν προσέρχεται: ἀλλὰ περιμένετε. ἀλλὰ περιμενοῦμεν, ἦ δ᾽ ὃς ὁ Γλαύκων. 
      <span style={{ color: 'brown' }}>[327c]</span>&nbsp;καὶ ὀλίγῳ ὕστερον ὅ τε Πολέμαρχος ἧκε καὶ Ἀδείμαντος ὁ τοῦ Γλαύκωνος ἀδελφὸς καὶ Νικήρατος ὁ Νικίου καὶ ἄλλοι τινὲς ὡς ἀπὸ τῆς πομπῆς.
    </span>
  </>
);

export const Classical3 = () => (
  <>
    <span style={{ color: 'blue' }}>
      <span style={{ color: 'brown' }}>[327c]</span>&nbsp; ὁ οὖν Πολέμαρχος ἔφη: ὦ Σώκρατες, δοκεῖτέ μοι πρὸς ἄστυ ὡρμῆσθαι ὡς ἀπιόντες. οὐ γὰρ κακῶς δοξάζεις, ἦν δ᾽ ἐγώ. ὁρᾷς 
      οὖν ἡμᾶς, ἔφη, ὅσοι ἐσμέν; πῶς γὰρ οὔ; ἢ τοίνυν τούτων, ἔφη, κρείττους γένεσθε ἢ μένετ&apos; αὐτοῦ. οὐκοῦν, ἦν δ᾽ ἐγώ, ἔτι ἓν λείπεται, τὸ ἢν πείσωμεν ὑμᾶς ὡς χρὴ ἡμᾶς 
      ἀφεῖναι; ἦ καὶ δύναισθ&apos; ἄν, ἦ δ᾽ ὅς, πεῖσαι μὴ ἀκούοντας; οὐδαμῶς, ἔφη ὁ Γλαύκων. ὡς τοίνυν μὴ ἀκουσομένων, οὕτω διανοεῖσθε.
    </span>
  </>
);

export const Classical4 = () => (
  <>
    <span style={{ color: 'blue' }}>
      <span style={{ color: 'brown' }}>[328a]</span>&nbsp; καὶ ὁ Ἀδείμαντος, ἆρά γε, ἦ δ᾽ ὅς, οὐδ&apos; ἴστε ὅτι λαμπὰς ἔσται πρὸς ἑσπέραν ἀφ&apos; ἵππων τῇ θεῷ; 
      ἀφ&apos; ἵππων; ἦν δ &apos;ἐγώ: καινόν γε τοῦτο. λαμπάδια ἔχοντες διαδώσουσιν ἀλλήλοις ἁμιλλώμενοι τοῖς ἵπποις; ἢ πῶς λέγεις; οὕτως, ἔφη ὁ Πολέμαρχος. καὶ πρός γε 
      παννυχίδα ποιήσουσιν, ἣν ἄξιον θεάσασθαι: ἐξαναστησόμεθα γὰρ μετὰ τὸ δεῖπνον καὶ τὴν παννυχίδα θεασόμεθα. καὶ συνεσόμεθά τε πολλοῖς τῶν νέων αὐτόθι καὶ διαλεξόμεθα. 
      ἀλλὰ μένετε <span style={{ color: 'brown' }}>[328b]</span> καὶ μὴ ἄλλως ποιεῖτε. καὶ ὁ Γλαύκων, ἔοικεν, ἔφη, μενετέον εἶναι. ἀλλ&apos; εἰ δοκεῖ, ἦν δ &apos;ἐγώ, οὕτω χρὴ ποιεῖν.
    </span>
  </>
);

export const Classical5 = () => (
  <>
    <span style={{ color: 'blue' }}>
      <span style={{ color: 'brown' }}>[328b]</span>&nbsp; ἦιμεν οὖν οἴκαδε εἰς τοῦ Πολεμάρχου, καὶ Λυσίαν τε αὐτόθι κατελάβομεν καὶ Εὐθύδημον, τοὺς τοῦ Πολεμάρχου ἀδελφούς, 
      καὶ δὴ καὶ Θρασύμαχον τὸν Καλχηδόνιον καὶ Χαρμαντίδην τὸν Παιανιᾶ καὶ Κλειτοφῶντα τὸν Ἀριστωνύμου: ἦν δ᾽ ἔνδον καὶ ὁ πατὴρ ὁ τοῦ Πολεμάρχου Κέφαλος. καὶ μάλα 
      πρεσβύτης μοι ἔδοξεν εἶναι: διὰ χρόνου γὰρ καὶ <span style={{ color: 'brown' }}>[328c]</span> ἑωράκη αὐτόν. καθῆστο δὲ ἐστεφανωμένος ἐπί τινος προσκεφαλαίου τε καὶ δίφρου: τεθυκὼς γὰρ ἐτύγχανεν ἐν τῇ αὐλῇ. 
      ἐκαθεζόμεθα οὖν παρ᾽ αὐτόν: ἔκειντο γὰρ δίφροι τινὲς αὐτόθι κύκλῳ.
    </span>
  </>
);

export const Classical6 = () => (
  <>
    <span style={{ color: 'blue' }}>
      <span style={{ color: 'brown' }}>[328c]</span>&nbsp; εὐθὺς οὖν με ἰδὼν ὁ Κέφαλος ἠσπάζετό τε καὶ εἶπεν: ὦ Σώκρατες, οὐ δὲ θαμίζεις ἡμῖν καταβαίνων εἰς τὸν Πειραιᾶ. χρῆν μέντοι. 
      εἰ μὲν γὰρ ἐγὼ ἔτι ἐν δυνάμει ἦ τοῦ ῥᾳδίως πορεύεσθαι πρὸς τὸ ἄστυ, οὐδὲν ἂν σὲ ἔδει δεῦρο [328δ] ἰέναι, ἀλλ᾽ ἡμεῖς ἂν παρὰ σὲ ᾖμεν: νῦν δέ σε χρὴ πυκνότερον δεῦρο ἰέναι. 
      ὡς εὖ ἴσθι ὅτι ἔμοιγε ὅσον αἱ ἄλλαι αἱ κατὰ τὸ σῶμα ἡδοναὶ ἀπομαραίνονται, τοσοῦτον αὔξονται αἱ περὶ τοὺς λόγους ἐπιθυμίαι τε καὶ ἡδοναί. μὴ οὖν ἄλλως ποίει, 
      ἀλλὰ τοῖσδέ τε τοῖς νεανίσκοις σύνισθι καὶ δεῦρο παρ᾽ ἡμᾶς φοίτα ὡς παρ᾽ φίλους τε καὶ πάνυ οἰκείους.
    </span>
  </>
);

